package org.example;

public class Task3 {
    // Задача: вывести имена работников + размер бонусов,
    // у которых бонус менее 1000, в том числе нет бонусов (0 или null)

    //  Дано:
    //  Employee(id, name)
    //  Bonus (id, bonus, employee_id)

    /*
    SELECT ...
     */


    // **
    // Задача: вывести имена работников + размер бонусов,
    // у которых бонус менее 1000, в том числе нет бонусов (0 или null)
    // если бонус == null, то отобразить 0 (CASE WHEN ... THEN ... ELSE)

    /*
    SELECT ...
     */

}